app/Views/partials/navbar.php

SELECT *
FROM `settings`
WHERE `setting_key` = 'global_ai_mode'
---
$aiMode = false;
try {
    $db      = \Config\Database::connect();
    $setting = $db->table('settings')->where('setting_key', 'global_ai_mode')->get()->getRow();