app/Modules/Settings/Models/SettingsModel.php

    public function getAllGrouped(): array
    {
        $rows   = $this->findAll();
---
SELECT *
FROM `settings`