app/Modules/Tickets/Models/TicketsModel.php

SELECT COUNT(*) AS `numrows`
FROM `tickets`
WHERE `status` = 'open'
---
    public function countByStatus(bool $isAdmin, int $staffId): array
    {
        $statuses = ['open', 'pending', 'resolved', 'closed'];
        $result   = [];

        foreach ($statuses as $status) {
            $builder = $this->db->table('tickets');
            if (! $isAdmin) {
                $builder->groupStart()
                    ->where('assigned_staff_id', $staffId)
                    ->orWhere('assigned_staff_id IS NULL')
                    ->groupEnd();
            }
            $result[$status] = $builder->where('status', $status)->countAllResults();